Repository: xMoney-Payments/WooCommerce
Catalog: lang/xmoney-payments-*.po
Languages: ro_ro

source: try again
ro_ro: încearcă din nou

source: [RESPONSE-ERROR]: Decryption failed.
ro_ro: [RESPONSE-ERROR]: Decriptarea nu a funcționat.

source: [RESPONSE-ERROR]: Empty externalOrderId
ro_ro: [RESPONSE-ERROR]: ExternalOrderId gol

source: [RESPONSE-ERROR]: Empty identifier
ro_ro: [RESPONSE-ERROR]: Identificator nul

source: [RESPONSE-ERROR]: Empty status
ro_ro: [RESPONSE-ERROR]: Status nul

source: [RESPONSE-ERROR]: Empty transactionId
ro_ro: [RESPONSE-ERROR]: TransactionID nul

source: [RESPONSE-ERROR]: Failed to call server:
ro_ro: [RESPONSE-ERROR]: Eroare la apelarea server-ului:

source: [RESPONSE-ERROR]: Failed to set server status for order ID:
ro_ro: [RESPONSE-ERROR]: Eroare la setarea starii pentru comanda ci ID-ul:

source: [RESPONSE-ERROR]: Invalid order identification key.
ro_ro: [RESPONSE-ERROR]: Cheie de identificare a comenzii nevalidă.

source: [RESPONSE-ERROR]: Order does not exist.
ro_ro: [RESPONSE-ERROR]: Comanda nu există.

source: [RESPONSE-ERROR]: Private key is not valid.
ro_ro: [RESPONSE-ERROR]: Cheie privată nevalidă.

source: [RESPONSE-ERROR]: Received empty response.
ro_ro: [RESPONSE-ERROR]: Răspunsul primit este nul.

source: [RESPONSE-ERROR]: Unexpected HTTP response code:
ro_ro: [RESPONSE-ERROR]: Cod HTTP neasteptat:

source: [RESPONSE-ERROR]: Validation failed.
ro_ro: [RESPONSE-ERROR]: Validare esuată pentru comanda cu ID-ul:

source: [RESPONSE-ERROR]: Wrong status:
ro_ro: [RESPONSE-ERROR]: Status greșit:

source: [RESPONSE]: Decryption successfully performed.
ro_ro: [RESPONSE]: Decriptare efectuata cu succes.

source: [RESPONSE]: Server status set for order ID:
ro_ro: [RESPONSE]: Starea de pe server setata pentru comanda cu ID-ul:

source: [RESPONSE]: Status complete-ok for order ID:
ro_ro: [RESPONSE]: Status complet-ok

source: [RESPONSE]: Status failed for order ID:
ro_ro: [RESPONSE]: Status failed pentru comanda cu ID-ul:

source: [RESPONSE]: Status on-hold for order ID:
ro_ro: [RESPONSE]: Status on-hold pentru comanda cu ID-ul:

source: [RESPONSE]: Status refund-ok for order ID:
ro_ro: [RESPONSE]: Status refund-ok pentru comanda cu ID-ul:

source: [RESPONSE]: Validating completed for order ID:
ro_ro: [RESPONSE]: Validare cu succes pentru comanda cu ID-ul:

source: Accept for virtual orders
ro_ro: Acceptă comenzile virtuale

source: Accept xMoney Payments if the order is virtual
ro_ro: Acceptă xMoney Payments în cazul comenzilor virtuale

source: All
ro_ro: Toate

source: An error occurred:
ro_ro: S-a petrecut o eroare:

source: Cancel a recurring order
ro_ro: Anulează o comandă recurentă

source: Configuration
ro_ro: Configurație

source: Configuration has been edited successfully.
ro_ro: Configurația a fost editată cu succes.

source: Contact email(Optional)
ro_ro: E-mail de contact (Opțional)

source: Customer name
ro_ro: Numele clientului

source: Default
ro_ro: Mod implicit

source: Description
ro_ro: Descriere

source: Enable for shipping methods
ro_ro: Activează pentru căile de expediere

source: Enable xMoney Payments Payments
ro_ro: Activează plățile xMoney Payments

source: Enable/Disable
ro_ro: Activează/Dezactivează

source: Enter the Private Key for Live Mode. You can get one from
ro_ro: Introdu Private Key-ul pentru modul Live. Poți obține unul de

source: Enter the Private Key for Staging Mode. You can get one from
ro_ro: Introdu Site ID-ul pentru modul Staging. Poți obține unul de

source: Enter the Site ID for Live Mode. You can get one from
ro_ro: Introdu Site ID-ul pentru modul Live. Poți obține unul de

source: Enter the Site ID for Staging Mode. You can get one from
ro_ro: Introdu Site ID-ul pentru modul Staging. Poți obține unul de

source: Following payment transaction will be refunded:
ro_ro: Următoarea tranzație de plată va fi restituită:

source: Following recurring order will be canceled:
ro_ro: Următoarea plată recurentă va fi anulată:

source: Have your customers pay with xMoney Payments payment gateway.
ro_ro: Invită-ți clienții să folosească gateway-ul de plată xMoney Payments.

source: here
ro_ro: aici

source: If xMoney Payments is only available for certain shipping methods, set it up here. Leave blank to enable for all methods.
ro_ro: Dacă xMoney Payments este disponibil numai pentru anumite căi de expediere, configurează-le de aici. Lasă necompletat pentru a activa toate căile.

source: If you want to display custom Thank you page, set it up here. You can create new custom page from
ro_ro: Dacă dorești să afișezi pagina personalizată de Thank You, configureaz-o aici. Poți crea o pagină personalizată nouă de

source: Live mode
ro_ro: Mod live

source: Missing includes/admin/configuration/configuration for plugin.
ro_ro: include

source: No
ro_ro: Nu

source: No items found.
ro_ro: Nu s-au găsit tranzacții.

source: No log recorded yet.
ro_ro: Nicio intrare înregistrată încă

source: One integration, multiple payment methods. xMoney Payments enables you to accept payments from virtually anywhere in the world through a myriad of payment methods.
ro_ro: O integrare, mai multe metode de plată. xMoney Payments vă permite să acceptați plăți practic de oriunde în lume, printr-o multitudine de metode de plată.

source: Option to suppress the communication sent by the ecommerce system, in order to configure it from xMoney Payments’s Merchant interface.
ro_ro: Opțiunea de a dezactiva comunicarea trimisă de sistemul de e-commerce, pentru a o configura din interfața de comerciant xMoney Payments.

source: Order reference
ro_ro: Numărul comenzii

source: Orders with subscriptions cannot have other products too.
ro_ro: Comenzile cu abonamente nu pot sa contina mai mult de un produs.

source: Put this URL in your xMoney Payments account.
ro_ro: Introdu această adresă URL în contul tău xMoney Payments.

source: Recurring could not been processed.
ro_ro: Plata recurentă nu a putut fi procesată.

source: Recurring processed successfully.
ro_ro: Comandă recurentă procesată cu succes.

source: Redirect to custom Thank you page
ro_ro: Redirecționare la pagina personalizată de Thank You

source: Refund could not been processed.
ro_ro: Restituirea nu a putut fi procesată.

source: Refund Payment Transaction
ro_ro: Tranzacție de restituire a plății

source: Refund processed successfully. Refresh the page in seconds to see the update.
ro_ro: Restituirea a fost procesată cu succes. Reîncarcă pagina în câteva secunde pentru a vedea actualizarea.

source: Save changes
ro_ro: Salvează modificările

source: Search Order
ro_ro: Caută comandă

source: Select "Yes" if you want to use the payment gateway in Production Mode or "No" if you want to use it in Staging Mode.
ro_ro: Selectează "Da" dacă dorești să folosești gateway-ul de plată în modul Live sau "Nu" dacă dorești să îl utilizezi în modul Staging.

source: Select shipping methods
ro_ro: Selectează căile de expediere

source: Server-to-server notification URL
ro_ro: Adresă URL de notificare server-to-server

source: Subscriptions synchronization finished.
ro_ro: Sincronizarea abonamentelor terminata.

source: Suppress default WooCommerce payment receipt emails
ro_ro: Dezactivează e-mailurile implicite WooCommerce de confirmare a plății

source: Synchronize subscriptions
ro_ro: Sincronizeaza abonamentele

source: Synchronize the local status of all subscriptions with the server status.
ro_ro: Sincronizeaza starea locala cu starea de pe server a tuturor abonamentelor.

source: Thank you. Your transaction is approved.
ro_ro: Mulțumim. Tranzacția ta a fost aprobată.

source: The order has no items.
ro_ro: Comanda nu are nici un produs.

source: The payment could not be processed. Please
ro_ro: Plata nu a putut fi procesată. Te rog

source: This controls the description which the customer sees during checkout.
ro_ro: Controlează descrierea pe care clientul o vede în timpul efectuării plății.

source: This controls the title which the customer sees during checkout.
ro_ro: Controlează titlul pe care îl vede clientul în timpul efectuării plății.

source: This email will be used on the payment error page.
ro_ro: Acest e-mail va fi folosit pe pagina de eroare de plată.

source: Title
ro_ro: Titlu

source: Transaction ID
ro_ro: ID-ul tranzacției

source: Transaction list
ro_ro: Lista de tranzacții

source: Transaction log
ro_ro: Jurnal de tranzacții

source: Transaction log in raw form.
ro_ro: Jurnal de tranzacții în formă brută

source: Website manager pressed on refund button successfully
ro_ro: Managerul site-ului a apăsat cu succes butonul de restituire

source: xMoney Payments general settings.
ro_ro: Setări generale xMoney Payments.

source: xMoney Payments payment failed
ro_ro: Plata xMoney Payments a fost finalizată cu eroare

source: xMoney Payments payment finalised successfully
ro_ro: Plata xMoney Payments a fost finalizată cu succes

source: xMoney Payments payment is on hold
ro_ro: Plata xMoney Payments este in asteptare

source: xMoney Payments requires WooCommerce plugin to work normally. Please activate it or install it from
ro_ro: xMoney Payments necesită pluginul WooCommerce pentru a funcționa normal. Activează-l sau instalează-l de

source: Yes
ro_ro: Da

source: You are not allowed to access this file.
ro_ro: Nu ai permisiunea de a accesa acest fișier.
